var ksName = ''; //name
var MyEvent = 1; //определяет последнее напрвление в ленте событий 1 вперед 0 назад
var arrMyEvent = [[0,0,0],[1,1,0],[1,2,0],[1,3,0],
                  [2,4,1],[2,5,2],
                  [5,0,3],[5,6,4],[5,7,5],[5,8,6],[6,0,7],[6,6,8],[6,7,9],[6,8,10],
                  [7,0,11],[7,6,12],[7,7,13],[7,8,14],
                  [8,0,15],[8,6,16],[8,7,17],[8,8,18],
                  [9,0,19],[9,6,20],[9,7,21],[9,8,22],
                  [10,0,23],[10,6,24],[10,7,25],[10,8,26],
                  [11,0,27],[11,6,28],[11,7,29],[11,8,30],
                  [0,9,1],[3,10,0],[3,11,0],[4,0,0],[4,12,0],[0,0,0]];
//номер заголовка из arrTitle, номер молитвы из arrPray, номер картинки из arrPicture

var ReCycle = 0;
var arrPray = [" ",
               " ",
			   " ",
			   " ",
			   " У імя Айца і Сына, і Духа Святога. Амэн.",
               "Веру ў Бога, Айца ўсемагутнага, Стварыцеля неба і зямлі, і ў Езуса Хрыста, Сына Яго адзінага,\
                Пана нашага, які быў зачаты ад Духа Святога, нарадзіўся з Дзевы Марыі, замучаны пры Понцкім \
                Пілаце, укрыжаваны, памёр і быў пахаваны; зышоў да адхлані, на трэці дзень уваскрос \
                з памерлых, узышоў на неба, сядзіць праваруч Бога Айца ўсемагутнага, адтуль прыйдзе судзіць\
                 жывых і памерлых. \
                                    \
                Веру ў Духа Святога, святы Касцёл каталіцкі, еднасць святых, адпушчэнне грахоў, \
                уваскрашэнне цела, жыццё вечнае. Амэн.",
                "Ойча наш, каторы ёсць у небе, свяціся iмя Тваё, прыйдзi Валадарства Тваё, \
                будзь воля Твая як у небе, так i на зямлi.\
                Хлеба нашага штодзённага дай нам сёння, і адпусцi нам правіны нашы, як i мы \
                адпускаем вiнаватым нашым, і не ўводзь нас у спакусу, але збаў нас ад злога.\
                 Амэн.\
				 \
				 \
				 ",
                "Вітай, Марыя, поўная ласкі, Пан з Табою, благаслаўлёная Ты між жанчынамі і \
                благаслаўлёны плод улоння Твайго, Езус. \
                                                         \
                Святая Марыя, Маці Божая, маліся за нас, грэшных, цяпер і ў хвіліну смерці \
                нашай. Амэн.",
                "Хвала Айцу і Сыну, і Духу Святому. Як была спрадвеку, цяпер і заўсёды, \
                 і на векі вечныя. Амэн.",
                 "Спашлі Духа Твайго, Пане, і ўзнікне жыццё, — і адновіш аблічча зямлі.",
                 "Божа, Ты асвячаеш сэрцы верных Табе святлом Духа Святога, \
                 дазволь нам у тым жа Духу спазнаць праўду і заўсёды радавацца Ягонаму\
                  суцяшэнню. Праз Хрыста, Пана нашага. Амэн.",
                "Беззаганная Абранніца Духа Святога — маліся за нас.",
                "Духу Святы, які сышоў у самым пачатку Касцёла на апосталаў і верных, \
                каб асвяціць іх розум, запаліць сэрцы і ўмацаваць у веры. Просім Цябе: \
                будзь заўсёды таксама з намі, напаўняй нас Тваімі дарамі, прасвятляй у \
                сумненнях, суцяшай у смутку, ратуй у небяспецы, выбаўляй ад памылак, \
                падымай пры падзенні, кіруй намі мудрасцю Тваёй, яднай нас узаемнай \
                хрысціянскай любоўю, каб усе мы жылі ў згодзе і святой еднасці як адна \
                Божая сям’я. Давядзі ўсіх нас да шчаслівай вечнасці, каб там з усімі анёламі \
                і святымі мы выказвалі Табе ўдзячнасць і хвалу на векі вечныя. Амэн."];
var arrTitle = ["",
               "Малітва за святара ",
               "Вяночак да Духа Святога",
               "Молімся.",
               "Малітва да Духа Святога",
               "1. Будзь праслаўлёны, Божа, Духу Святы, і наведай нас у дары мудрасці.",
               "2. Будзь праслаўлёны, Божа, Духу Святы, і наведай нас у дары розуму.",
               "3. Будзь праслаўлёны, Божа, Духу Святы, і наведай нас у дары рады.",
               "4. Будзь праслаўлёны, Божа, Духу Святы, і наведай нас у дары мужнасці.",
               "5. Будзь праслаўлёны, Божа, Духу Святы, і наведай нас у дары ўмеласці.",
               "6. Будзь праслаўлёны, Божа, Духу Святы, і наведай нас у дары пабожнасці.",
               "7. Будзь праслаўлёны, Божа, Духу Святы, і наведай нас у дары боязі Божай."];

var arrPicture = ["Pole1.png","Pole2.png","Pole2-1.png","Pole2-2.png",
				"Pole2-3.png","Pole2-4.png","Pole2-5.png","Pole2-6.png","Pole2-7.png",
				"Pole2-8.png","Pole2-9.png","Pole2-10.png","Pole2-11.png","Pole2-12.png",
				"Pole2-13.png","Pole2-14.png","Pole2-15.png","Pole2-16.png","Pole2-17.png",
				"Pole2-18.png","Pole2-19.png","Pole2-20.png","Pole2-21.png","Pole2-22.png",
				"Pole2-23.png","Pole2-24.png","Pole2-25.png","Pole2-26.png","Pole2-27.png",
				"Pole2-28.png","Pole2-29.png"];

document.getElementById("BNext").onclick = function(){
        /*alert(arrMyEvent[10][1]);*/
		ReCycle++;
        if (ReCycle == 1) {
	ksName = document.getElementById("fname").value;
		arrPray[1] = "О Езу, Божы Пастыр, які паклікаў Апосталаў, \
        каб зрабіць іх лаўцамі душаў, Ты, які паклікаў да сябе святара " +ksName +" учыні яго \
        сваім руплівым паслядоўнікам і слугою. Учыні таксама, каб ён падзяляў Тваё жаданне \
        паўсюднага адкуплення, дзеля якога Ты аднаўляеш на алтарах сваю Ахвяру. \
        О Пане, Ты жывеш вечна, каб заступацца за свой народ, адкрый перад ім гарызонты, \
        каб убачыў увесь свет, які прагне святла праўды і любові, каб стаў соллю зямлі і \
        святлом свету. Умацоўвай яго Тваёю моцаю і благаславі яго.";

        arrPray[2] = "Святы _______, сёння мы даручаем святара "+ksName+" тваёй асаблівай апецы. Просім цябе \
               заступацца за яго перад Богам і дапамагаць яму ва ўсіх патрэбах. Дапамажы яму захаваць \
               вернасць Богу і плённа працаваць дзеля Яго хвалы.";
		arrPray[3] ="Марыя, сцеражы святара " +ksName+" ад усялякага зла. Амэн.";

       	document.querySelector("#text2").textContent = "";
        const finput = document.querySelector("#fname");
        const parentfinput = finput.parentNode;
        parentfinput.removeChild(finput);

        }
        
        document.querySelector("#text1").textContent =  arrTitle[arrMyEvent[ReCycle][0]];
        document.querySelector("#text2").textContent =  arrPray[arrMyEvent[ReCycle][1]];
        document.getElementById("pole").src = "PIC/"+arrPicture[arrMyEvent[ReCycle][2]];

                    
                    }
document.getElementById("BPreview").onclick = function(){
	
		if (ReCycle > 2)ReCycle--;
		document.querySelector("#text1").textContent =  arrTitle[arrMyEvent[ReCycle][0]];
        document.querySelector("#text2").textContent =  arrPray[arrMyEvent[ReCycle][1]];
        document.getElementById("pole").src = "PIC/"+arrPicture[arrMyEvent[ReCycle][2]];
        
	
}